In [22]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
df = pd.read_csv("train.csv")

In [23]:
def get_title(name):
    if '.' in name:
        return name.split(',')[1].split('.')[0].strip()
    else:
        return "No title in name"

In [24]:
titles = set([x for x in df.Name.map(lambda x: get_title(x))])

In [25]:
print(titles)

{'Ms', 'Sir', 'Mr', 'Dr', 'Major', 'Miss', 'Mlle', 'Mme', 'Col', 'Master', 'Mrs', 'Rev', 'Capt', 'Jonkheer', 'the Countess', 'Don', 'Lady'}

In [36]:
def shorter_titles(x):
    title = x["Title"]
    if title in ["Capt","Col","Major"]:
        return "Officer"
    elif title in ["Jonkheer","Don","the Countess","Dona","Lady","Sir"]:
        return "Royalty"
    elif title == "Mme":
        return "Mrs"
    elif title in ["Mlle","Ms"]:
        return "Miss"
    else:
        return title

In [37]:
df["Title"] = df["Name"].map(lambda x: get_title(x))

In [38]:
df["Title"] = df.apply(shorter_titles, axis = 1)

In [39]:
print(df.Title.value_counts())

Mr         517
Miss       185
Mrs        126
Master      40
Dr           7
Rev          6
Royalty      5
Officer      5
Name: Title, dtype: int64

In [40]:
df.drop("Name",axis=1,inplace=True)

In [41]:
df.sample(20)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
128,129,1,3,female,NaN,1,1,2668,22.3583,F E69,C,Miss
177,178,0,1,female,50.0,0,0,PC 17595,28.7125,C49,C,Miss
255,256,1,3,female,29.0,0,2,2650,15.2458,NaN,C,Mrs
628,629,0,3,male,26.0,0,0,349224,7.8958,NaN,S,Mr
409,410,0,3,female,NaN,3,1,4133,25.4667,NaN,S,Miss
742,743,1,1,female,21.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,Miss
677,678,1,3,female,18.0,0,0,4138,9.8417,NaN,S,Miss
810,811,0,3,male,26.0,0,0,3474,7.8875,NaN,S,Mr
22,23,1,3,female,15.0,0,0,330923,8.0292,NaN,Q,Miss
98,99,1,2,female,34.0,0,1,231919,23.0000,NaN,S,Mrs
787,788,0,3,male,8.0,4,1,382652,29.1250,NaN,Q,Master
448,449,1,3,female,5.0,2,1,2666,19.2583,NaN,C,Miss
306,307,1,1,female,NaN,0,0,17421,110.8833,NaN,C,Miss
839,840,1,1,male,NaN,0,0,11774,29.7000,C47,C,Mr
199,200,0,2,female,24.0,0,0,248747,13.0000,NaN,S,Miss
656,657,0,3,male,NaN,0,0,349223,7.8958,NaN,S,Mr
401,402,0,3,male,26.0,0,0,341826,8.0500,NaN,S,Mr
181,182,0,2,male,NaN,0,0,SC/PARIS 2131,15.0500,NaN,C,Mr
162,163,0,3,male,26.0,0,0,347068,7.7750,NaN,S,Mr
55,56,1,1,male,NaN,0,0,19947,35.5000,C52,S,Mr

In [42]:
df.drop("Ticket",axis=1,inplace=True)

In [43]:
df.sample(10)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Title
793,794,0,1,male,NaN,0,0,30.6958,NaN,C,Mr
828,829,1,3,male,NaN,0,0,7.7500,NaN,Q,Mr
516,517,1,2,female,34.0,0,0,10.5000,F33,S,Mrs
173,174,0,3,male,21.0,0,0,7.9250,NaN,S,Mr
150,151,0,2,male,51.0,0,0,12.5250,NaN,S,Rev
148,149,0,2,male,36.5,0,2,26.0000,F2,S,Mr
791,792,0,2,male,16.0,0,0,26.0000,NaN,S,Mr
369,370,1,1,female,24.0,0,0,69.3000,B35,C,Mrs
810,811,0,3,male,26.0,0,0,7.8875,NaN,S,Mr
352,353,0,3,male,15.0,1,1,7.2292,NaN,C,Mr

In [45]:
df.Sex.replace(("male","female"),(0,1), inplace=True)
df.Embarked.replace(("S","C","Q"),(0,1,2), inplace=True)
df.Title.replace(("Mr","Miss","Mrs","Master","Dr","Rev","Officer","Royalty"),(0,1,2,3,4,5,6,7), inplace=True)

In [46]:
df.sample(20)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Title
238,239,0,2,0,19.00,0,0,10.5000,NaN,0.0,0
330,331,1,3,1,NaN,2,0,23.2500,NaN,2.0,1
826,827,0,3,0,NaN,0,0,56.4958,NaN,0.0,0
866,867,1,2,1,27.00,1,0,13.8583,NaN,1.0,1
39,40,1,3,1,14.00,1,0,11.2417,NaN,1.0,1
267,268,1,3,0,25.00,1,0,7.7750,NaN,0.0,0
275,276,1,1,1,63.00,1,0,77.9583,D7,0.0,1
639,640,0,3,0,NaN,1,0,16.1000,NaN,0.0,0
524,525,0,3,0,NaN,0,0,7.2292,NaN,1.0,0
400,401,1,3,0,39.00,0,0,7.9250,NaN,0.0,0
78,79,1,2,0,0.83,0,2,29.0000,NaN,0.0,3
17,18,1,2,0,NaN,0,0,13.0000,NaN,0.0,0
366,367,1,1,1,60.00,1,0,75.2500,D37,1.0,2
532,533,0,3,0,17.00,1,1,7.2292,NaN,1.0,0
784,785,0,3,0,25.00,0,0,7.0500,NaN,0.0,0
204,205,1,3,0,18.00,0,0,8.0500,NaN,0.0,0
254,255,0,3,1,41.00,0,2,20.2125,NaN,0.0,2
839,840,1,1,0,NaN,0,0,29.7000,C47,1.0,0
794,795,0,3,0,25.00,0,0,7.8958,NaN,0.0,0
539,540,1,1,1,22.00,0,2,49.5000,B39,1.0,1